Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲིའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the smell element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་དྲིའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the smell element.

source: དེ་བཞིན་གཤེགས་པས་དེ་ལ་ཡང་ཞེས་བྱ་བ་ནས།
en: Moreover, the Thus-Gone One . . . and so forth, up to . . .

source: གལ་ཏེ་རོ་བྲོ་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance, the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པ་དྲིའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the smell element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: he can respond for an eon, and so forth, up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the nose consciousness element.

source: སྣ་དང་དྲི་ལ་བརྟེན་ནས། སྣའི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: Based on the nose and smell, the nose consciousness manifests.

source: དངོས་པོ་སོ་སོར་རྣམ་པར་རིག་པའི་མཚན་ཉིད་དེ་སྐྱེ་བ་ན་ནང་གི་སྣ་ལས་ཀྱང་མ་བྱུང་།
en: When the features of cognized entities manifest, the nose consciousness does not arise within the nose.

source: ཕྱི་རོལ་གྱི་དྲི་དག་ལས་ཀྱང་མ་འོངས། བར་དུ་རྣམ་པར་བཟུང་སྟེ་
en: It also does not appear from the outer smells and neither is it maintained somewhere in between.

source: ཡང་མི་གནས་འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་ལ།
en: It is beyond coming and going.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the nose consciousness element .

source: དེ་བཞིན་གཤེགས་པ་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the nose consciousness element,

source: དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་བའི་བར་དུའོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the nose consciousness element.

source: སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the nose consciousness element,

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the nose consciousness element.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the nose consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the nose consciousness element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ་སྣང་བ་བྱས་ཤིང་མུན་པ་བསལ་ཏེ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them. He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་སྣའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the nose consciousness element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the nose consciousness element.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the nose consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the nose consciousness element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the nose consciousness element.

source: དེ་བཞིན་གཤེགས་པ་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the nose consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the tongue element.

source: ཟིན་པའི་འབྱུང་བ་ཆེན་པོ་རྒྱུར་བྱས་པའི་དང་བ་གང་ཡིན་པ་ནི་ལྕེའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The tongue is the ripening of subtle matter derived from the primary elements conjoined with mind.

source: ལྕེའི་སྐྱེ་མཆེད་གང་ལ་རོ་སྣང་བར་འགྱུར་བ་དང་།
en: On the sense source of the tongue, tastes are perceived.

source: རོ་ཡང་ཐོགས་པ་དང་། ལྕེ་གང་རོ་དག་ལ་ཐོགས་པ་དང་། ལྕེ་གང་ལ་ཡང་རོ་ཐོགས་པ་དང་།
en: The tongue is obstructed by taste, but it also obstructs taste.

source: རོ་མྱངས་པ་དང་། ལྕེ་གང་རོ་མྱོང་བ་དང་། རོ་མྱོང་བར་འགྱུར་བ་དང་།
en: The tongue has tasted, it tastes, and it will taste.

source: རོ་དག་མྱང་བར་བྱ་བའི་ཕྱིར། རྟག་ཏུ་ཐ་མི་དད་ཅིང་རུང་བའི་ལྕེ་གང་ཡིན་པ་དང་།
en: In order to perceive taste, the tongue is always undifferentiated.

source: ཁམས་བཅྭ་བརྒྱད་དག་ལས་ལྕེའི་ཁམས་གང་ཡིན་པ་དང་།
en: The tongue is also included within the eighteen elements as the tongue element.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ལས་ལྕེའི་སྐྱེ་མཆེད་གང་ཡིན་པ་དང་།
en: Among the twelve sense sources it is the tongue sense source.

source: དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་དག་ལས་ལྕེའི་དབང་པོ་གང་ཡིན་པ་སྟེ།
en: Among the twenty-two faculties it is the tongue faculty.

source: དེ་ནི་ལྕེ་ཡང་ཡིན།
en: It is the tongue;

source: དེ་ནི་ལྕེའི་ཁམས་ཀྱང་ཡིན།
en: it is the tongue element;

source: དེ་ནི་ལྕེའི་སྐྱེ་མཆེད་ཀྱང་ཡིན།
en: it is the tongue sense source.

source: དེ་ནི་ལྕེའི་དབང་པོ་ཡང་ཡིན།
en: It is the tongue faculty.

source: དེ་ནི་བདག་གི་དངོས་པོར་འཇུག་པ་ཡང་ཡིན། །
en: It engages with the entities of the self.

source: དེ་ནི་ལྕེའི་ཁམས་ཞེས་བྱའོ། །
en: That is what is known as the tongue element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ལྕེའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the tongue element .

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the tongue element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the tongue element.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས། ལྕེའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the tongue element, having accumulated roots of virtue in the presence of limitless blessed buddhas.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ལྕེའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the tongue element.

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the tongue element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the tongue element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ལ། སྣང་བ་བྱས་ཤིང་མུན་པ་བསལ་ནས།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them. He illuminated them and cleared away their darkness.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་གྱི་རྒྱ་མཚོ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས་བདེ་བ་ལ་བཙུད་པ་ནི་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from the ocean of suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the tongue element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the tongue element.

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན། བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the tongue element, he can respond for an eon, and so forth, up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the tongue element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ལྕེའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the tongue element.

source: དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་བཞིན་གཤེགས་པ་ལྕེའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the tongue element,

source: བསྐལ་པར་ལན་གསུང་ཞིང་། དེའི་སྤོབས་པ་ཟད་མི་ཤེས་སོ། །
en: he can respond for an eon, and so forth, since his eloquence is inexhaustible.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རོའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the taste element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལྕེའི་ཁམས་ཀྱི་སྤྱོད་ཡུལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། འདི་ལྟ་སྟེ།
en: Householder, the Thus-Gone One correctly understands the sense object of the tongue element in this way:

source: རོ་ཞིམ་པ་ཉིད་དང་། རོ་མི་ཞིམ་པ་ཉིད་དང་། རོ་འདོད་པ་ཉིད་དང་། རོ་མི་འདོད་པ་ཉིད་དང་། རོ་ཡི་གར་འོང་བ་ཉིད་དང་། རོ་ཡི་གར་མི་འོང་བ་ཉིད་དང་། རོ་ཡིད་དུ་འོང་བ་ཉིད་དང་། རོ་ཡིད་དུ་མི་འོང་བ་ཉིད་དང་། རོའི་ངོ་བོ་དགའ་བ་ཉིད་དང་། རོའི་ངོ་བོ་མི་དགའ་བ་ཉིད་དང་། རོའི་ངོ་བོ་ལེགས་པ་ཉིད་དང་། རོའི་ངོ་བོ་མ་ལེགས་པ་ཉིད་དང་། ཁ་བ་འཛིན་པ་དང་། ཚ་བ་འཛིན་པ་དང་། སྐྱུར་བ་འཛིན་པ་དང་། མངར་བ་འཛིན་པ་དང་། རོ་བ་ཚྭ་ཅན་ཉིད་ནས་རོ་བསྐ་བ་ཉིད་དང་། ལན་ཚྭའི་རོ་དང་། རོ་གང་དག་སྣོད་ན་ཡོད་པ་དང་། རྩ་བ་ལ་ཡོད་པ་དང་། སྙིང་པོ་ལ་ཡོད་པ་དང་། སྙིང་པོ་མེད་པ་ལ་ཡོད་པ་དང་། ཤུན་པ་ལ་ཡོད་པ་དང་། དར་བ་ལ་ཡོད་པ་དང་། ལོ་མ་ལ་ཡོད་པ་དང་། མེ་ཏོག་ལ་ཡོད་པ་དང་། འབྲས་བུ་ལ་ཡོད་པའི་བར་གྱི་རོ་གང་དག་ཡོད་པ་འདི་ནི་རོའི་ཁམས་ཞེས་བྱ་སྟེ
en: It consists of pleasant tastes, unpleasant tastes, desirable tastes, undesirable tastes, sweet tastes, awful tastes, agreeable tastes, disagreeable tastes, delightful tastes, offensive tastes, fine tastes, repulsive tastes, as well as tastes that are bitter, hot, sour, sweet, salty, astringent, and saline. The taste element also consists of tastes that are found in the environment: roots, kernels, hollow plants, bark, stems, leaves, flowers, and fruits.

source: དེ་བཞིན་གཤེགས་པ་རོའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the taste element,

source: བསྐལ་པར་ལན་གསུང་ཞིང་།
en: he can respond for an eon,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རོའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the taste element.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས། རོའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the taste element, having accumulated roots of virtue in the presence of limitless blessed buddhas.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ། རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་རོའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, moreover, the Thus-Gone One correctly understands the causes and conditions that accomplish knowledge of the origin as related to knowledge of the taste element.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་ལ་རོའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the taste element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་
en: he can respond for an eon, and so forth, up until . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རོའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the taste element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་རོའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the taste element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རོའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the taste element.

source: དེ་བཞིན་གཤེགས་པ་རོའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the taste element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རོའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the taste element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་རོའི་ཁམས་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་དེ། གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the taste element, whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: དེ་བཞིན་གཤེགས་པ་རོའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the taste element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the tongue consciousness element.

source: ལྕེ་དང་རོ་ལ་བརྟེན་ནས་ལྕེའི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: Based on the tongue and taste, the tongue consciousness manifests.

source: དངོས་པོ་སོ་སོར་རྣམ་པར་རིག་པའི་མཚན་ཉིད་དེ་སྐྱེ་བ་ན་ནང་གི་ལྕེ་ལས་ཀྱང་མ་བྱུང་།
en: When the features of cognized entities manifest, the tongue consciousness does not arise within the inner tongue.

source: ཕྱི་རོལ་གྱི་རོ་དག་ལས་ཀྱང་མ་འོངས། བར་དུ་རྣམ་པར་བཟུང་སྟེ་ཡང་མི་གནས།
en: It also does not come from the external tastes and neither is it maintained somewhere in between.

source: འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་ལ་
en: It is beyond coming and going.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the tongue consciousness element .

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the tongue consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the tongue consciousness element.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands how to gain knowledge of the origin as related to knowledge of the tongue consciousness element, having accumulated roots of virtue in the presence of limitless blessed buddhas.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: He correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the tongue consciousness element.

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the tongue consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the tongue consciousness element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས་བདེ་བ་ལ་བཙུད་པ་ནི་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the tongue consciousness element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the tongue consciousness element.

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the tongue consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the tongue consciousness element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་དེ་གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the path that leads to cessation as related to the tongue consciousness element. This is so whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: དེ་བཞིན་གཤེགས་པ་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the tongue consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the body element.

source: ཟིན་པའི་འབྱུང་བ་ཆེན་པོའི་རྒྱུར་བྱས་པ་དང་བ་གང་ཡིན་པ་ནི། ལུས་ཀྱི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The body is the ripening of subtle matter derived from the primary elements conjoined with mind.

source: ལུས་གང་གི་རེག་བྱ་སྣང་བར་འགྱུར་ཞིང་། རེག་བྱ་ཡང་ཐོགས་པ་དང་།
en: It perceives texture, and obstructs texture.

source: ལུས་གང་རེག་བྱ་ལ་ཐོགས་པ་དང་། ལུས་གང་ལ་རེག་བྱ་ཡང་ཐོགས་པ་དང་།
en: The body obstructs texture, and it is also obstructed by texture.

source: ལུས་གང་གིས་རེག་བྱ་ལ་རེག་པར་གྱུར་པ་དང་། རེག་པ་དང་རེག་པར་འགྱུར་བ་དང་།
en: The body has touched, touches, and will touch.

source: རེག་བྱ་ལ་རེག་པར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་ཐ་མི་དད་ཅིང་རུང་བའི་ལུས་གང་ཡིན་པ་དང་།
en: In order to perceive texture, the body is always undifferentiated.

source: ཁམས་བཅྭ་བརྒྱད་དག་ལས་ལུས་ཀྱི་ཁམས་གང་ཡིན་པ་དང་།
en: The body is also included within the eighteen elements as the body element.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ལས་ལུས་ཀྱི་སྐྱེ་མཆེད་གང་ཡིན་པ་དང་།
en: Among the twelve sense sources it is the body sense source.
